module.exports = {

  q1: 'Как купить билет',
  a1: '1) Предпочтительный способ - установить расширение Metamask и купить билет на этом сайте, перейдя в желаемую игру. ' +
  '2) Также можно просто отправить стоимость билета на ETHEREUM адрес контракта игры. В поле Transaction data напишите любое число/строку, с помощью которого будет рассчитана hash функция',

  q2: 'Когда раунд игры считается законченным',
  a2: 'Как только все билеты распроданы, контракт сразу же определяет победителя.',

  q3: 'Как мне получить выигрыш',
  a3: 'Выигрыш автоматически переводится на etherium кошелек c которого был куплен билет',

  q4: 'Если я переведу эфир на кошелек, указанный на сайте больше или меньше стоимости билета, то что произойдет',
  a4: 'Транзакция будет отменена и ETH не будет списан с вашего кошелька',




}
