module.exports = {

  h1: 'криптоигры с неизбежным выигрышем',
  h2: 'играть в один клик',

  menu1: 'все игры',
  menu2: 'статистика выигрышей',
  menu3: 'как сдесь играть',
  menu4: 'помощь/faq',

  commonJackpot: 'общий джекпот',
  game: 'Игра',
  toWin: 'Выиграть',

  maxTicketAmount: 'Количество билетов в раунде',

  benefit: 'Процент владельца',
  jpp: 'Процент джекпот',
  gpp: 'Процент победителя',

  about: 'Об играх',
  question: 'Задать вопрос',
  follow: 'Следите за нами',

  hello_world : 'Привет мир!',
  ticketPrice: 'Цена билета',
  transactionHash: 'Хеш транзакции',
  currentRound: 'Текущий Раунд',
  roundFinished: 'Раунд завершен',
  roundNotBegun: 'Раунд еще не начался',
  winner: 'Победитель',
  gain: 'Выигрыш',
  stock: 'Осталось билетов',
  bank: 'Банк',
  transaction: 'Транзакция',
  owner: 'Владелец',
  contacts: 'Контакты',
  partnership: 'Условия партнерства',

  m1: 'Ваш билет появится в списке, как только транзакция будет успешно завершена',
  m2: 'Аккаунт Metamask заблокирован',
  m3: 'Перейти к текущему раунду',
  m4: 'Текущий лидер',
  m5: 'В этом раунде еще не приобретались билеты! Купи первый!',
  m6: 'Работает децентрализовано на базе смарт-контрактов блокчейна Ethereum',

  metamaskStatus : {
    0: 'Metamsk is not detected',
    1: 'Metamsk is locked',
    2: 'Ethereum network is OK'
  },

  profile: 'Личный кабинет',

}

