module.exports = {

  h1: 'криптоигры с неизбежным выигрышем',
  h2: 'играть в один клик',
  date: 'дата',

  menu1: 'все игры',
  menu2: 'статистика выигрышей',
  menu3: 'как здесь играть',
  menu4: 'помощь/faq',

  shopHistory: 'история покупок',
  winHistory: 'история выигрышей',
  commonJackpot: 'общий джекпот',
  game: 'Игра',
  toWin: 'Выиграть',

  maxTicketAmount: 'Количество билетов в раунде',

  benefit: 'Процент владельца',
  jpp: 'Процент джекпот',
  gpp: 'Процент победителя',

  about: 'Об играх',
  question: 'Задать вопрос',
  follow: 'Следите за нами',

  hash: 'Хеш',
  player: 'Игрок',

  hello_world : 'Привет мир!',
  ticketPrice: 'Цена билета',
  transactionHash: 'Хеш транзакции',
  currentRound: 'Текущий Раунд',
  round: 'Раунд',
  roundFinished: 'Раунд завершен',
  roundNotBegun: 'Раунд еще не начался',
  winner: 'Победитель',
  gain: 'Выигрыш',
  stock: 'Осталось билетов',
  bank: 'Банк',
  transaction: 'Транзакция',
  owner: 'Владелец',
  contacts: 'Контакты',
  partnership: 'Условия партнерства',

  m1: 'Ваш билет появится в списке, как только транзакция будет успешно завершена',
  m2: 'Аккаунт Metamask заблокирован',
  m3: 'Перейти к текущему раунду',
  m4: 'Текущий лидер',
  m5: 'В этом раунде еще не приобретались билеты! Купи первый!',
  m6: 'Работает децентрализовано на базе смарт-контрактов блокчейна Ethereum',

  n1: 'Пока что вы ни разу не выиграли',
  n2: 'Пока что вы не купили ни одного билета',

  metamaskStatus : {
    0: 'Metamsk is not detected',
    1: 'Wrong Ethereum network',
    2: 'Metamsk is locked',
    3: 'Ethereum network is OK'
  },

  profile: 'Личный кабинет',
  grules: 'Правила игры и размеры выплат',
  jackpot: 'Джекпот',
  hashPhrase: 'Введите свою хеш фразу',

  t1: 'Вы можете купить билет, отправив',
  t2: 'на ethereum адрес',
  t3: 'укажите вашу уникальную хеш-фразу в transaction data, например:',

  txt1: "При покупке последнего билета в раунде, победителю будет отправлено вознаграждение на его адрес. Побеждает билет у которого самый маленький хеш. Если хэш билета победителя будет самым маленьким за историю игры, то победитель также получает джекпот. Следующий раунд начнется автоматически",
  txt2: "Для того чтоб начать играть в Galaxy Crypto Games, вам необходим кошелек ethereum. Существует множество вариантов для регистрации кошелька. Самые популярные из них:",
  txt3: "Мы рекомендуем выбрать для игры Metamask. Это расширение для браузера, которое позволяет выполнять операции в сети Ethereum, не покидая страницу. Кроме того при использовании Metamask у вас появится личный кабинет с историей ваших покупок и выигрышей",
  txt4: "Все игры - это смарт-контракты сети Ethereum. Их невозможно изменить, невозможно внезапно собрать криптовалюту и исчезнуть, нельзя подстроить выигрыш и т д. Все эти пиемущества обеспечены блокчейном Ethereum.",
  txt5: "Для того чтобы купить билет, достаточно отправить на смарт-контракт сумму, равную цене билета. При использовании Metamask, билет можно купить прямо со страницы игры, нажав на кнопку купить. При покупке билета рассчитывается хеш - это буквенноциферный код, например 0x123ABC. Побеждает владелец билета с минимальным хешем. Похожий принцип используется в майнинге. Например, из 2-х хешей 0x123.. и 0x321..., победит хеш 0x123..., т.к. он меньше.",
  txt6: "Хеш билета зависит от двух параметров - это ваше собственная хеш-фраза и хеш игры. Хеш игры меняется при покупке нового билета. Хеш игры никому не известен.Это означает, что хеш билета - случаен, но при этом зависит только от вас и от вашей удачи.",
  txt7: "При выигрыше, вознаграждение отправится на адрес победителя автоматически, это обеспечит смарт-контракт.",
  txt8: "После выигрыша, в игре начинается новый раунд. Определенная часть собранного банка отправляется в копилку джекпота. Выигрывает джекпот лучший в истории игры хеш билета."



}

